import styled from "styled-components";
import { Card } from "antd";
const SBoardList = styled.div`
  width: 100%;
  height: 100%;
`;
export const BoardList = () => {
  return (
    <SBoardList>
      <Card>
        <Card
          style={{ marginBottom: 16 }}
          type="inner"
          title="범죄를 통신·방송의 신문의 창달에 필요한 평생교육을 체결·공포된.범죄를 통신·방송의 신문의 창달에 필요한 평생교육을 체결·공포된."
          extra={<a href="#">More</a>}
        >
          영장을 대하여 법률로써 모든 형에 비밀과 한다. 현행범인인 소추되지
          사항은 형에 거듭 필요한 확정될 효력을 처벌받지 정하는 무죄로 염려가
          한다. 승인된 소추되지 헌법에 가진다. 저작자·발명가·과학기술자와 도피
          국제법규는 국제법규는 범죄에 계승·발전과 신문의 보호할 국내법과 법률이
          유죄의 도피 국민은 죄를 사생활의 다만, 모든 보호한다. 해당하는
          아니하며, 사생활의 의무교육은 가진다. 증거인멸의 정한다. 보호한다.
          사항은 범하고 같은 또는 보호를 염려가 무죄로 모성의 추정된다. 영장을
          유죄의 확정될 아니한다..
        </Card>
        <Card
          style={{ marginBottom: 16 }}
          type="inner"
          title="범죄를 통신·방송의 신문의 창달에 필요한 평생교육을 체결·공포된.범죄를 통신·방송의 신문의 창달에 필요한 평생교육을 체결·공포된."
          extra={<a href="#">More</a>}
          cover={
            <img
              alt="example"
              src="https://os.alipayobjects.com/rmsportal/QBnOOoLaAfKPirc.png"
            />
          }
        >
          영장을 대하여 법률로써 모든 형에 비밀과 한다. 현행범인인 소추되지
          사항은 형에 거듭 필요한 확정될 효력을 처벌받지 정하는 무죄로 염려가
          한다. 승인된 소추되지 헌법에 가진다. 저작자·발명가·과학기술자와 도피
          국제법규는 국제법규는 범죄에 계승·발전과 신문의 보호할 국내법과 법률이
          유죄의 도피 국민은 죄를 사생활의 다만, 모든 보호한다. 해당하는
          아니하며, 사생활의 의무교육은 가진다. 증거인멸의 정한다. 보호한다.
          사항은 범하고 같은 또는 보호를 염려가 무죄로 모성의 추정된다. 영장을
          유죄의 확정될 아니한다..
        </Card>
        <Card
          style={{ marginBottom: 16 }}
          type="inner"
          title="범죄를 통신·방송의 신문의 창달에 필요한 평생교육을 체결·공포된.범죄를 통신·방송의 신문의 창달에 필요한 평생교육을 체결·공포된."
          extra={<a href="#">More</a>}
        >
          영장을 대하여 법률로써 모든 형에 비밀과 한다. 현행범인인 소추되지
          사항은 형에 거듭 필요한 확정될 효력을 처벌받지 정하는 무죄로 염려가
          한다. 승인된 소추되지 헌법에 가진다. 저작자·발명가·과학기술자와 도피
          국제법규는 국제법규는 범죄에 계승·발전과 신문의 보호할 국내법과 법률이
          유죄의 도피 국민은 죄를 사생활의 다만, 모든 보호한다. 해당하는
          아니하며, 사생활의 의무교육은 가진다. 증거인멸의 정한다. 보호한다.
          사항은 범하고 같은 또는 보호를 염려가 무죄로 모성의 추정된다. 영장을
          유죄의 확정될 아니한다..
        </Card>
      </Card>
    </SBoardList>
  );
};
